app/controllers/leads_controller.rb

  def index
    @leads = Lead.all
---
SELECT "leads".* FROM "leads" WHERE (disposition LIKE '%new%') ORDER BY created_at DESC

  def create
    @user = Lead.new(lead_params)
    if @user.save
---
INSERT INTO "leads" ("first_name", "last_name", "phone_number", "disposition", "status", "center_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @user = Lead.find_by(id: params[:id])
---
SELECT  "leads".* FROM "leads" WHERE "leads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @user = Lead.find_by(id: params[:id])

      if @user.update_attributes(lead_params)
---
SELECT  "leads".* FROM "leads" WHERE "leads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "leads" SET "phone_number" = $1, "disposition" = $2, "status" = $3, "updated_at" = $4 WHERE "leads"."id" = $5  [["phone_number", "23@w"], ["disposition", "QA Rejected"], ["status", "Reject"], ["updated_at", "2017-06-06 03:53:29.136162"], ["id", 1]]