app/controllers/users_controller.rb

  def create
    @key = user_params[:secret_key]
    @user = User.new(user_params)
if @key == "123456"
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "admin", "hashed_password", "secret_key", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"