app/controllers/vendors_controller.rb

  def create
    @center_code = user_params[:center_code]
    p @center_code

    @user = Vendor.new(user_params)
    if @center_code == ""
        @user.errors.add(:center_code, "is needed")
      @errors = @user.errors.full_messages
      render :new
    else
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "center_code", "hashed_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = Vendor.find_by(id: params[:id])
    @center_code = @user.center_code

    # if @center_code == nil || @center_code == ""
    #     @user.errors.add(:center_code, "is needed")
    #   @errors = @user.errors.full_messages
    #   render :edit
    # else
      if @user.update_attributes(vendor_params)
---
UPDATE "users" SET "first_name" = $1, "email" = $2, "hashed_password" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "w"], ["email", "w@w"], ["hashed_password", "$2a$10$eZA/o2sB2Wp5C1YwxsdCX..tPD4fZsZ1tzq2/NuAWl3Gg2KYtDu9y"], ["updated_at", "2017-06-05 22:57:32.612630"], ["id", 6]]